#include<stdio.h>
#include "LinkStack.h"
int main()
{
    int i=0;
    Stack p; 
    Stack *s;
    s=&p;
    // struct stack s;
    //初始化栈
    printf("\n###########初始化栈###########\n");
    s=init(s);
    printf("----------------------------------");    
    //入栈操作
    printf("\n###########入栈操作###########\n");
    for(i=0;i<=10;i++)
    {
        s=Push(s,i);
    }
    printf("----------------------------------");
    //取栈顶元素
    printf("\n###########取栈顶元素###########\n");
    printf("%d\n",Top(s));
    printf("----------------------------------");    
    //出栈操作
    printf("\n###########出栈操作###########\n");
    for(i=0;i<=12;i++)
    {
        s=Pop(s);
    }  
    printf("----------------------------------");
    //取栈顶元素    
    printf("\n###########取栈顶元素###########\n");
    Top(s);
    printf("----------------------------------");
    //销毁栈
    printf("\n###########销毁栈###########\n"); 
    s=Push(s,10);
    Destroy(s);
    Top(s);
}