#include<stdio.h>
#include "LinkQueue.h"
int main()
{
    int i=0;
    Queue s;
    Queue *q=&s;
    // struct stack s;
    //初始化队
    printf("\n###########初始化队###########\n");
    init(q);
    printf("----------------------------------");    
    //入队操作
    printf("\n###########入队操作###########\n");
    for(i=2;i<=10;i++)
    {
        Push(q,i);
    }
    printf("----------------------------------");
    //取队顶元素
    printf("\n###########取队顶元素###########\n");
    printf("%d\n",Top(q));
    printf("----------------------------------");    
    //出队操作
    printf("\n###########出队操作###########\n");
    for(i=2;i<=12;i++)
    {
        Pop(q);
    }  
    printf("----------------------------------");
    //取队顶元素    
    printf("\n###########取队顶元素###########\n");
    Top(q);
    printf("----------------------------------");
    //销毁队
    printf("\n###########销毁队###########\n"); 
    Push(q,10);
    Destroy(q);
    Top(q);
}