#include<stdio.h>
#include "DynamicStack.h"
int main()
{
    int i=0;
    // struct stack s;
    //初始化栈
    printf("\n###########初始化栈###########\n");
    init();
    printf("----------------------------------");    
    //入栈操作
    printf("\n###########入栈操作###########\n");
    for(i=0;i<=10;i++)
    {
        Push(i);
    }
    printf("----------------------------------");
    printf("\n###########取栈顶元素###########\n");
    printf("%d\n",Top());
    printf("----------------------------------");    
    //出栈操作
    printf("\n###########出栈操作###########\n");
    for(i=0;i<=10;i++)
    {
        Pop();
    }  
    printf("----------------------------------");    
    printf("\n###########取栈顶元素###########\n");
    Top();
    printf("----------------------------------");
    printf("\n###########销毁栈###########\n"); 
    Push(10);
    Destroy();
    Top();
}